# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [27]:
import pandas as pd
import numpy as np

In [28]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a -0.262825  0.126738  2.247583
c  1.519463  1.438949 -1.460901
e -0.416750  0.243748 -1.760518
f -1.487597 -0.158308  1.179116
h -0.906892 -1.371894  0.280536

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [29]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a -0.262825  0.126738  2.247583  bar  False
c  1.519463  1.438949 -1.460901  bar   True
e -0.416750  0.243748 -1.760518  bar  False
f -1.487597 -0.158308  1.179116  bar  False
h -0.906892 -1.371894  0.280536  bar  False

Adding new rows is also simple. Below we include three extra empty rows:

In [30]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a -0.262825  0.126738  2.247583  bar  False
b       NaN       NaN       NaN  NaN    NaN
c  1.519463  1.438949 -1.460901  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -0.416750  0.243748 -1.760518  bar  False
f -1.487597 -0.158308  1.179116  bar  False
g       NaN       NaN       NaN  NaN    NaN
h -0.906892 -1.371894  0.280536  bar  False

# Your Turn Here

Do you still remember how to index a row/column?

In [36]:
#### index row 'c' below
df2.iloc[2,:]

one      1.51946
two      1.43895
three    -1.4609
four         bar
five        True
Name: c, dtype: object

In [37]:
#### index column 'two' below
df2.iloc[:,1]

a    0.126738
b         NaN
c    1.438949
d         NaN
e    0.243748
f   -0.158308
g         NaN
h   -1.371894
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [38]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [39]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [40]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

        one       two
a       NaN  0.126738
c       NaN  1.438949
e       NaN  0.243748
f -1.487597 -0.158308
h -0.906892 -1.371894

In [41]:
b = df[['one','two','three']]
b

        one       two     three
a -0.262825  0.126738  2.247583
c  1.519463  1.438949 -1.460901
e -0.416750  0.243748 -1.760518
f -1.487597 -0.158308  1.179116
h -0.906892 -1.371894  0.280536

In [42]:
a + b

        one  three       two
a       NaN    NaN  0.253477
c       NaN    NaN  2.877898
e       NaN    NaN  0.487495
f -2.975194    NaN -0.316616
h -1.813783    NaN -2.743787

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [43]:
a['one'].dropna()

f   -1.487597
h   -0.906892
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [44]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a  0.126738
c  1.438949
e  0.243748
f -0.158308
h -1.371894

In [45]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN  0.253477
c       NaN  2.877898
e       NaN  0.487495
f -2.975194 -0.316616
h -1.813783 -2.743787

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [46]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN  0.253477
c       NaN  2.877898
e       NaN  0.487495
f -2.975194 -0.316616
h -1.813783 -2.743787

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [47]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [48]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [49]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [50]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [51]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a       NaN -0.664989 -2.201888
b       NaN       NaN  0.993007
c  0.154580 -0.709328       NaN
d -1.115924  0.258221 -0.273967
e  0.671613       NaN  0.021576

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [59]:
#### insert your code here

# fill missing values in column one with value 1;
rand_df['one'] = rand_df['one'].fillna(1)
#rand_df

# fill missing values in column two with forward-filling;
rand_df['two'] = rand_df['two'].fillna(method='ffill')
#rand_df

# fill missing values in column two with backward-filling;
rand_df['three'] = rand_df['three'].fillna(method='bfill')
rand_df

        one       two     three
a  1.000000 -0.664989 -2.201888
b  1.000000 -0.664989  0.993007
c  0.154580 -0.709328 -0.273967
d -1.115924  0.258221 -0.273967
e  0.671613  0.258221  0.021576

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [60]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a -0.225556 -0.853936 -1.676293
b -1.178562 -1.010724 -0.547079
c -1.258302 -1.266343  1.690812
d -0.060925  0.189823  0.419779
e       NaN -0.995439  0.067521

In [61]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [62]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A   -0.680836
B   -0.787324
C   -0.009052
dtype: float64

In [63]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a -0.225556 -0.853936 -1.676293
b -1.178562 -1.010724 -0.547079
c -1.258302 -1.266343  1.690812
d -0.060925  0.189823  0.419779
e -0.680836 -0.995439  0.067521

In [64]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.